# 云计算技术介绍
---
### 目录/Contents
- 云计算
- 虚拟化技术
- 容器与容器云
- 云端的大数据
---
### 什么是云计算
- 计算模型视角   
利用大规模低成本计算单元，通过网络连接，以提供多种存储和计算服务的IT系统.     
- 底层支撑技术视角    
传统计算机和网络技术发展、融合的产物.    
- 服务提供视角    
海量高并发(用户规模大规模增长后所需的负载均衡/弹性伸缩)的产物.    
---
### 云计算发展历程
![./images/2018_02_08_10_46_26_1837x761.jpg](./images/2018_02_08_10_46_26_1837x761.jpg)
---
### 云的特点
* 规模可控
* 高可靠，弹性伸缩
* 通用，不针对特定应用
* 按需服务，按量计费
---
### 云计算类型(按服务分类)
![./images/2018_02_08_10_54_00_744x528.jpg](./images/2018_02_08_10_54_00_744x528.jpg)    
---
### 云计算类型(按服务分类)
- IAAS    
提供最基本的计算/存储/网络等资源，如Amazon,Azure,Google,
阿里云，Vmware, Citrix, 红帽, Canonical等。    
- PAAS    
提供基于网络的应用开发环境，如OpenShift, Heroku, GCE等。    
- SAAS    
最常用的云计算提供方式，通过Web端或APP端提供服务，如Salesforce,
taleo,Dropbox,slack等    
---
### 云计算类型(按落地分类)
![./images/2018_02_08_11_00_20_1495x569.jpg](./images/2018_02_08_11_00_20_1495x569.jpg)    
- 公有云(基于互联网)/ 私有云(企业内部)/ 混合云
---
### 云计算架构(OpenStack为例)
![](./images/2018_02_08_13_04_37_1029x524.jpg)
---
### 虚拟化技术
- 通用定义    
同一物理硬件上同时运行多个操作系统的技术    
- 虚拟化种类    
桌面虚拟化、服务器虚拟化、网络虚拟化、存储虚拟化、应用虚拟化等    
- 底层技术种类    
全虚拟化、半虚拟化、容器虚拟化    
---
### 虚拟化技术关键特征
![](./images/2018_02_08_12_29_25_1614x595.jpg)

---
### 虚拟化技术优势

![./images/2018_02_08_11_13_55_769x769.jpg](./images/2018_02_08_11_13_55_769x769.jpg)    
---
### 虚拟化技术优势

![./images/2018_02_08_11_14_39_900x781.jpg](./images/2018_02_08_11_14_39_900x781.jpg)    
---
### 容器技术

![./images/2018_02_08_11_15_57_825x498.jpg](./images/2018_02_08_11_15_57_825x498.jpg)    
---
### 什么是容器
- 软件分发领域的集装箱技术.    
- 一种轻量级、可移植、自包含的软件打包技术，使用容器技术可以使得软件/应用程序在几乎任何地方以相同方式运行    
- Demo
---
### 容器技术背景
![](./images/2018_02_08_11_20_05_1477x836.jpg)
---
### 容器技术背景
![](./images/2018_02_08_11_20_22_1407x827.jpg)
---
### 容器技术背景
![](./images/2018_02_08_11_20_39_1482x830.jpg)
---
### 容器技术背景
![](./images/2018_02_08_11_21_09_1482x829.jpg)
---
### 容器技术背景
![](./images/2018_02_08_12_22_14_1221x608.jpg)
---
### 容器技术背景
![](./images/2018_02_08_11_21_48_1479x836.jpg)
---
### 容器技术背景
![](./images/2018_02_08_12_22_32_1129x602.jpg)
---
### 容器发展历程
![](./images/2018_02_08_11_22_47_1685x773.jpg)
---
### 容器技术亮点
![](./images/2018_02_08_11_23_26_1524x680.jpg)
---
### 容器生态
![](./images/2018_02_08_11_37_03_1417x822.jpg)
---
### 容器与虚拟化
![](./images/2018_02_08_11_24_55_801x448.jpg)
---
### 容器与虚拟化
![](./images/2018_02_08_11_25_09_792x444.jpg)
---
### 容器与虚拟化
- 容器技术比经典虚拟化技术更为轻量级    
- 互补、双赢：    
虚拟化技术提供弹性基础架构、更好的安全隔离、动态热迁移等。    
容器化技术简化云应用迁移，实现无边界云计算.    
---
### 容器云平台(Kubernetes为例)
![](./images/2018_02_08_11_30_56_718x515.jpg)
---
### 容器云平台(Kubernetes为例)
![](./images/2018_02_08_11_31_30_918x523.jpg)
---
### 大数据与云计算
![](./images/2018_02_08_11_33_19_1187x598.jpg)
---
### 大数据计算模型
![](./images/2018_02_08_12_19_15_715x414.jpg)
---
### 大数据组件架构
![](./images/2018_02_08_11_38_46_1127x639.jpg)
---
### 大数据与云计算
![](./images/2018_02_08_11_40_14_1356x519.jpg)
---
### 大数据与云计算
![](./images/2018_02_08_11_40_46_1272x596.jpg)
---
### 大数据与云计算(解决方案)
![](./images/2018_02_08_11_41_36_683x386.jpg)
---
### 大数据与云计算(解决方案)
![](./images/2018_02_08_11_41_53_686x384.jpg)
---
### 大数据与云计算(解决方案）
![](./images/2018_02_08_11_39_23_797x403.jpg)
---
# 谢谢
